Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.debug.retrieval.funnel.keywordFormat
source: Keyword matches: %1$lld found, %2$lld excluded by source settings, %3$lld kept.
ar: تطابقات الكلمات المفتاحية: %1$lld تم العثور عليها، %2$lld مستبعدة بواسطة إعدادات المصدر، %3$lld محفوظة.
de: Stichworttreffer: %1$lld gefunden, %2$lld durch Quelleinstellungen ausgeschlossen, %3$lld behalten.
es: Coincidencias de palabras clave: %1$lld encontradas, %2$lld excluidas por configuración de fuente, %3$lld conservadas.
fr: Correspondances par mot-clé : %1$lld trouvées, %2$lld exclues par les paramètres de source, %3$lld conservées.
id: Kecocokan kata kunci: %1$lld ditemukan, %2$lld dikecualikan oleh pengaturan sumber, %3$lld disimpan.
it: Corrispondenze per parole chiave: %1$lld trovate, %2$lld escluse dalle impostazioni della fonte, %3$lld mantenute.
ja: キーワード一致: %1$lld 件見つかり、%2$lld 件がソース設定で除外、%3$lld 件が保持されました。
ko: 키워드 일치: %1$lld개 발견, %2$lld개 출처 설정에서 제외, %3$lld개 유지.
nl: Trefwoordovereenkomsten: %1$lld gevonden, %2$lld uitgesloten door broninstellingen, %3$lld behouden.
pl: Dopasowania słów kluczowych: %1$lld znaleziono, %2$lld wykluczono przez ustawienia źródła, %3$lld zachowano.
pt_br: Correspondências por palavra-chave: %1$lld encontradas, %2$lld excluídas pelas configurações de fonte, %3$lld mantidas.
ru: Совпадения по ключевым словам: найдено %1$lld, исключено настройками источника %2$lld, оставлено %3$lld.
tr: Anahtar kelime eşleşmeleri: %1$lld bulundu, %2$lld kaynak ayarlarıyla hariç tutuldu, %3$lld korundu.
uk: Збіги за ключовими словами: знайдено %1$lld, виключено %2$lld налаштуваннями джерела, залишено %3$lld.
vi: Khớp từ khóa: %1$lld tìm thấy, %2$lld bị loại bởi cài đặt nguồn, %3$lld được giữ lại.
zh_hans: 关键词匹配：找到 %1$lld 条，因来源设置排除 %2$lld 条，保留 %3$lld 条。
zh_hant: 關鍵字匹配：找到 %1$lld 條，因來源設定排除 %2$lld 條，保留 %3$lld 條。

# rag.workspace.debug.retrieval.funnel.rankingFormat
source: Chunk ranking: %1$lld unique chunks; %2$lld excluded by the per-repository limit, %3$lld by the total limit, and %4$lld by the combined retrieval-score threshold.
ar: ترتيب الأجزاء: %1$lld جزءًا فريدًا؛ %2$lld مستبعدة بواسطة حد المستودع، %3$lld بواسطة الحد الإجمالي، و%4$lld بواسطة حد درجة الاسترجاع المجمعة.
de: Chunk-Ranking: %1$lld eindeutige Chunks; %2$lld durch das Pro-Repository-Limit ausgeschlossen, %3$lld durch das Gesamtlimit und %4$lld durch den kombinierten Abruf-Score-Schwellenwert.
es: Clasificación de fragmentos: %1$lld fragmentos únicos; %2$lld excluidos por el límite por repositorio, %3$lld por el límite total y %4$lld por el umbral combinado de puntuación de recuperación.
fr: Classement des fragments : %1$lld fragments uniques ; %2$lld exclus par la limite par dépôt, %3$lld par la limite totale et %4$lld par le seuil de score de récupération combiné.
id: Peringkat potongan: %1$lld potongan unik; %2$lld dikecualikan oleh batas per repositori, %3$lld oleh batas total, dan %4$lld oleh ambang skor pengambilan gabungan.
it: Ranking chunk: %1$lld chunk unici; %2$lld esclusi dal limite per repository, %3$lld dal limite totale e %4$lld dalla soglia combinata del punteggio di recupero.
ja: チャンクランキング: %1$lld 個の一意チャンク; %2$lld 個がリポジトリごとの制限で除外、%3$lld 個が全体制限で除外、%4$lld 個が複合検索スコアしきい値で除外されました。
ko: 청크 순위: %1$lld개 고유 청크 중 %2$lld개가 저장소별 제한, %3$lld개가 전체 제한, %4$lld개가 결합 검색 점수 임계값으로 제외되었습니다.
nl: Chunk-rangschikking: %1$lld unieke chunks; %2$lld uitgesloten door de limiet per repository, %3$lld door de totale limiet en %4$lld door de gecombineerde ophaalscoredrempel.
pl: Ranking fragmentów: %1$lld unikalnych fragmentów; %2$lld wykluczono przez limit na repozytorium, %3$lld przez limit całkowity, a %4$lld przez próg łącznego wyniku wyszukiwania.
pt_br: Classificação de fragmentos: %1$lld fragmentos únicos; %2$lld excluídos pelo limite por repositório, %3$lld pelo limite total e %4$lld pelo limite combinado de pontuação de recuperação.
ru: Ранжирование фрагментов: %1$lld уникальных фрагментов; %2$lld исключено лимитом на репозиторий, %3$lld общим лимитом и %4$lld комбинированным порогом оценки поиска.
tr: Parça sıralaması: %1$lld benzersiz parça; %2$lld depo başına limitle, %3$lld toplam limitle ve %4$lld birleşik alma puanı eşiğiyle hariç tutuldu.
uk: Ранжування фрагментів: %1$lld унікальних фрагментів; %2$lld виключено лімітом на репозиторій, %3$lld загальним лімітом, %4$lld порогом комбінованої оцінки пошуку.
vi: Xếp hạng khối: %1$lld khối duy nhất; %2$lld bị loại bởi giới hạn mỗi kho lưu trữ, %3$lld bởi giới hạn tổng và %4$lld bởi ngưỡng điểm truy xuất kết hợp.
zh_hans: 分片排序：去重后 %1$lld 条；因单仓库上限排除 %2$lld 条、因总数上限排除 %3$lld 条、因综合检索分阈值排除 %4$lld 条。
zh_hant: 分片排序：去重後 %1$lld 條；因單倉庫上限排除 %2$lld 條、因總數上限排除 %3$lld 條、因綜合檢索分閾值排除 %4$lld 條。

# rag.workspace.debug.retrieval.funnel.resultFormat
source: Final chunks: %1$lld chunks from %2$lld repositories.
ar: الأجزاء النهائية: %1$lld جزءًا من %2$lld مستودعًا.
de: Finale Chunks: %1$lld Chunks aus %2$lld Repositories.
es: Fragmentos finales: %1$lld fragmentos de %2$lld repositorios.
fr: Fragments finaux : %1$lld fragments provenant de %2$lld dépôts.
id: Potongan akhir: %1$lld potongan dari %2$lld repositori.
it: Chunk finali: %1$lld chunk da %2$lld repository.
ja: 最終チャンク: %1$lld 個のチャンク（%2$lld リポジトリから）
ko: 최종 청크: %1$lld개 저장소에서 %2$lld개 청크.
nl: Definitieve chunks: %1$lld chunks uit %2$lld repositories.
pl: Ostateczne fragmenty: %1$lld fragmentów z %2$lld repozytoriów.
pt_br: Fragmentos finais: %1$lld fragmentos de %2$lld repositórios.
ru: Финальные фрагменты: %1$lld фрагментов из %2$lld репозиториев.
tr: Son parçalar: %1$lld depodan %2$lld parça.
uk: Остаточні фрагменти: %1$lld фрагментів з %2$lld репозиторіїв.
vi: Khối cuối cùng: %1$lld khối từ %2$lld kho lưu trữ.
zh_hans: 最终分片：%1$lld 条，来自 %2$lld 个仓库。
zh_hant: 最終分片：%1$lld 條，來自 %2$lld 個倉庫。

# rag.workspace.debug.retrieval.funnel.semanticFormat
source: Semantic matches: %1$lld found, %2$lld excluded by source settings, %3$lld below the similarity threshold, %4$lld kept.
ar: التطابقات الدلالية: %1$lld تم العثور عليها، %2$lld مستبعدة بواسطة إعدادات المصدر، %3$lld أقل من حد التشابه، %4$lld محفوظة.
de: Semantische Treffer: %1$lld gefunden, %2$lld durch Quelleinstellungen ausgeschlossen, %3$lld unter dem Ähnlichkeitsschwellenwert, %4$lld behalten.
es: Coincidencias semánticas: %1$lld encontradas, %2$lld excluidas por configuración de fuente, %3$lld por debajo del umbral de similitud, %4$lld conservadas.
fr: Correspondances sémantiques : %1$lld trouvées, %2$lld exclues par les paramètres de source, %3$lld en dessous du seuil de similarité, %4$lld conservées.
id: Kecocokan semantik: %1$lld ditemukan, %2$lld dikecualikan oleh pengaturan sumber, %3$lld di bawah ambang kemiripan, %4$lld disimpan.
it: Corrispondenze semantiche: %1$lld trovate, %2$lld escluse dalle impostazioni della fonte, %3$lld sotto la soglia di similarità, %4$lld mantenute.
ja: セマンティック一致: %1$lld 件見つかり、%2$lld 件がソース設定で除外、%3$lld 件が類似度しきい値未満、%4$lld 件が保持されました。
ko: 의미 일치: %1$lld개 발견, %2$lld개 출처 설정에서 제외, %3$lld개 유사도 임계값 미만, %4$lld개 유지.
nl: Semantische overeenkomsten: %1$lld gevonden, %2$lld uitgesloten door broninstellingen, %3$lld onder de overeenkomstdrempel, %4$lld behouden.
pl: Dopasowania semantyczne: %1$lld znaleziono, %2$lld wykluczono przez ustawienia źródła, %3$lld poniżej progu podobieństwa, %4$lld zachowano.
pt_br: Correspondências semânticas: %1$lld encontradas, %2$lld excluídas pelas configurações de fonte, %3$lld abaixo do limite de similaridade, %4$lld mantidas.
ru: Семантические совпадения: найдено %1$lld, исключено настройками источника %2$lld, ниже порога схожести %3$lld, оставлено %4$lld.
tr: Anlamsal eşleşmeler: %1$lld bulundu, %2$lld kaynak ayarlarıyla hariç tutuldu, %3$lld benzerlik eşiğinin altında, %4$lld korundu.
uk: Семантичні збіги: знайдено %1$lld, виключено %2$lld налаштуваннями джерела, %3$lld нижче порогу подібності, залишено %4$lld.
vi: Khớp ngữ nghĩa: %1$lld tìm thấy, %2$lld bị loại bởi cài đặt nguồn, %3$lld dưới ngưỡng tương đồng, %4$lld được giữ lại.
zh_hans: 语义匹配：找到 %1$lld 条，因来源设置排除 %2$lld 条，低于相似度阈值排除 %3$lld 条，保留 %4$lld 条。
zh_hant: 語意匹配：找到 %1$lld 條，因來源設定排除 %2$lld 條，低於相似度閾值排除 %3$lld 條，保留 %4$lld 條。

# rag.workspace.debug.retrieval.funnel.title
source: Retrieval Process
ar: عملية الاسترجاع
de: Abrufprozess
es: Proceso de recuperación
fr: Processus de récupération
id: Proses Pengambilan
it: Processo di recupero
ja: 検索プロセス
ko: 검색 과정
nl: Ophaalproces
pl: Proces wyszukiwania
pt_br: Processo de Recuperação
ru: Процесс поиска
tr: Alma Süreci
uk: Процес пошуку
vi: Quy trình truy xuất
zh_hans: 检索过程
zh_hant: 檢索過程

# rag.workspace.debug.retrieval.query.ftsFormat
source: FTS5 expression: %@
ar: تعبير FTS5: %@
de: FTS5-Ausdruck: %@
es: Expresión FTS5: %@
fr: Expression FTS5 : %@
id: Ekspresi FTS5: %@
it: Espressione FTS5: %@
ja: FTS5 式: %@
ko: FTS5 표현식: %@
nl: FTS5-expressie: %@
pl: Wyrażenie FTS5: %@
pt_br: Expressão FTS5: %@
ru: Выражение FTS5: %@
tr: FTS5 ifadesi: %@
uk: Вираз FTS5: %@
vi: Biểu thức FTS5: %@
zh_hans: FTS5 表达式：%@
zh_hant: FTS5 表達式：%@

# rag.workspace.debug.retrieval.query.semanticFallback
source: Source: optimized-query fallback
ar: المصدر: استعلام محسن بديل
de: Quelle: Optimierte-Abfrage-Fallback
es: Fuente: respaldo de consulta optimizada
fr: Source : repli de requête optimisée
id: Sumber: fallback kueri yang dioptimalkan
it: Fonte: fallback query ottimizzata
ja: ソース: 最適化クエリのフォールバック
ko: 출처: 최적화 쿼리 대체
nl: Bron: terugval geoptimaliseerde query
pl: Źródło: zastępcze zapytanie zoptymalizowane
pt_br: Fonte: fallback de consulta otimizada
ru: Источник: запасной оптимизированный запрос
tr: Kaynak: optimize edilmiş sorgu yedeği
uk: Джерело: резервний оптимізований запит
vi: Nguồn: dự phòng truy vấn tối ưu
zh_hans: 来源：优化问题降级
zh_hant: 來源：最佳化問題降級

# rag.workspace.debug.retrieval.query.termsFormat
source: Terms: %@
ar: المصطلحات: %@
de: Begriffe: %@
es: Términos: %@
fr: Termes : %@
id: Istilah: %@
it: Termini: %@
ja: 用語: %@
ko: 용어: %@
nl: Termen: %@
pl: Terminy: %@
pt_br: Termos: %@
ru: Термины: %@
tr: Terimler: %@
uk: Терміни: %@
vi: Thuật ngữ: %@
zh_hans: 关键词：%@
zh_hant: 關鍵字：%@

# rag.workspace.debug.retrieval.query.title
source: Keyword Query
ar: استعلام الكلمات المفتاحية
de: Stichwortabfrage
es: Consulta de palabras clave
fr: Requête par mot-clé
id: Kueri Kata Kunci
it: Query per parole chiave
ja: キーワードクエリ
ko: 키워드 쿼리
nl: Trefwoordquery
pl: Zapytanie słów kluczowych
pt_br: Consulta por Palavra-chave
ru: Поиск по ключевым словам
tr: Anahtar Kelime Sorgusu
uk: Запит за ключовими словами
vi: Truy vấn từ khóa
zh_hans: 关键词查询
zh_hant: 關鍵字查詢

# rag.workspace.debug.retrieval.rerank.completed
source: Rerank (%@): processed %lld candidates, returned %lld in %.2fs.
ar: إعادة الترتيب (%@): تمت معالجة %lld مرشحًا، وأُعيد %lld في %.2f ثانية.
de: Rerank (%@): %lld Kandidaten verarbeitet, %lld zurückgegeben in %.2fs.
es: Rerank (%@): procesó %lld candidatos, devolvió %lld en %.2fs.
fr: Reranking (%@) : %lld candidats traités, %lld renvoyés en %.2fs.
id: Rerank (%@): memproses %lld kandidat, mengembalikan %lld dalam %.2f detik.
it: Rerank (%@): elaborati %lld candidati, restituiti %lld in %.2fs.
ja: 再ランク (%@): %lld 件の候補を処理、%lld 件を返却（%.2f 秒）
ko: Rerank (%@): %lld개 후보 처리, %lld개 반환 (%.2f초)
nl: Rerank (%@): %lld kandidaten verwerkt, %lld geretourneerd in %.2fs.
pl: Rerank (%@): przetworzono %lld kandydatów, zwrócono %lld w %.2fs.
pt_br: Reclassificação (%@): processados %lld candidatos, retornados %lld em %.2fs.
ru: Реранжирование (%@): обработано %lld кандидатов, возвращено %lld за %.2f с.
tr: Rerank (%@): %lld aday işlendi, %lld aday %.2fs içinde döndürüldü.
uk: Реранжування (%@): оброблено %lld кандидатів, повернуто %lld за %.2f с.
vi: Rerank (%@): đã xử lý %lld ứng viên, trả về %lld trong %.2fs.
zh_hans: Rerank（%@）：处理 %lld 条候选，返回 %lld 条，耗时 %.2f 秒。
zh_hant: Rerank（%@）：處理 %lld 條候選，返回 %lld 條，耗時 %.2f 秒。

# rag.workspace.debug.retrieval.rerank.disabled
source: Rerank: disabled.
ar: إعادة الترتيب: معطلة.
de: Rerank: deaktiviert.
es: Rerank: deshabilitado.
fr: Reranking : désactivé.
id: Rerank: dinonaktifkan.
it: Rerank: disabilitato.
ja: 再ランク: 無効。
ko: Rerank: 비활성화됨.
nl: Rerank: uitgeschakeld.
pl: Rerank: wyłączony.
pt_br: Reclassificação: desabilitada.
ru: Реранжирование: отключено.
tr: Rerank: devre dışı.
uk: Реранжування: вимкнено.
vi: Rerank: đã tắt.
zh_hans: Rerank：未启用。
zh_hant: Rerank：未啟用。

# rag.workspace.debug.retrieval.rerank.failed
source: Rerank (%@): failed for %lld candidates; kept hybrid order. %@
ar: إعادة الترتيب (%@): فشلت لـ %lld مرشحًا؛ تم الاحتفاظ بالترتيب المختلط. %@
de: Rerank (%@): fehlgeschlagen für %lld Kandidaten; hybride Reihenfolge beibehalten. %@
es: Rerank (%@): falló para %lld candidatos; se conservó el orden híbrido. %@
fr: Reranking (%@) : échec pour %lld candidats ; ordre hybride conservé. %@
id: Rerank (%@): gagal untuk %lld kandidat; urutan hibrida dipertahankan. %@
it: Rerank (%@): fallito per %lld candidati; mantenuto ordine ibrido. %@
ja: 再ランク (%@): %lld 件の候補で失敗、ハイブリッド順序を維持。%@
ko: Rerank (%@): %lld개 후보에 대해 실패하여 하이브리드 순서 유지. %@
nl: Rerank (%@): mislukt voor %lld kandidaten; hybride volgorde behouden. %@
pl: Rerank (%@): nie powiódł się dla %lld kandydatów; zachowano kolejność hybrydową. %@
pt_br: Reclassificação (%@): falhou para %lld candidatos; manteve ordem híbrida. %@
ru: Реранжирование (%@): не удалось для %lld кандидатов; сохранён гибридный порядок. %@
tr: Rerank (%@): %lld aday için başarısız oldu; hibrit sıra korundu. %@
uk: Реранжування (%@): не вдалося для %lld кандидатів; збережено гібридний порядок. %@
vi: Rerank (%@): thất bại cho %lld ứng viên; giữ nguyên thứ tự kết hợp. %@
zh_hans: Rerank（%@）：处理 %lld 条候选失败，已保留综合检索顺序。%@
zh_hant: Rerank（%@）：處理 %lld 條候選失敗，已保留綜合檢索順序。%@

# rag.workspace.debug.retrieval.rerank.skipped
source: Rerank (%@): skipped because there were no candidates.
ar: إعادة الترتيب (%@): تم التخطي لعدم وجود مرشحين.
de: Rerank (%@): übersprungen, da keine Kandidaten vorhanden waren.
es: Rerank (%@): omitido porque no había candidatos.
fr: Reranking (%@) : ignoré car aucun candidat.
id: Rerank (%@): dilewati karena tidak ada kandidat.
it: Rerank (%@): saltato perché non c'erano candidati.
ja: 再ランク (%@): 候補がないためスキップされました。
ko: Rerank (%@): 후보가 없어 건너뜀.
nl: Rerank (%@): overgeslagen omdat er geen kandidaten waren.
pl: Rerank (%@): pominięto, ponieważ nie było kandydatów.
pt_br: Reclassificação (%@): ignorada porque não havia candidatos.
ru: Реранжирование (%@): пропущено, так как не было кандидатов.
tr: Rerank (%@): aday olmadığı için atlandı.
uk: Реранжування (%@): пропущено, оскільки не було кандидатів.
vi: Rerank (%@): bỏ qua vì không có ứng viên.
zh_hans: Rerank（%@）：没有候选分片，已跳过。
zh_hant: Rerank（%@）：沒有候選分片，已跳過。

# rag.workspace.debug.retrieval.settings.evidenceLimitsFormat
source: Chunk limits: up to %1$lld chunks total, with %2$lld per repository.
ar: حدود الأجزاء: حتى %1$lld جزءًا إجمالاً، مع %2$lld لكل مستودع.
de: Chunk-Limits: bis zu %1$lld Chunks insgesamt, mit %2$lld pro Repository.
es: Límites de fragmentos: hasta %1$lld fragmentos en total, con %2$lld por repositorio.
fr: Limites de fragments : jusqu'à %1$lld fragments au total, avec %2$lld par dépôt.
id: Batas potongan: hingga %1$lld potongan total, dengan %2$lld per repositori.
it: Limiti chunk: fino a %1$lld chunk in totale, con %2$lld per repository.
ja: チャンク制限: 合計最大 %1$lld チャンク、リポジトリあたり %2$lld チャンク
ko: 청크 제한: 총 %1$lld개, 저장소당 %2$lld개.
nl: Chunklimieten: maximaal %1$lld chunks in totaal, met %2$lld per repository.
pl: Limity fragmentów: do %1$lld fragmentów łącznie, z %2$lld na repozytorium.
pt_br: Limites de fragmentos: até %1$lld fragmentos no total, com %2$lld por repositório.
ru: Лимиты фрагментов: всего до %1$lld фрагментов, не более %2$lld на репозиторий.
tr: Parça limitleri: toplam %1$lld parçaya kadar, depo başına %2$lld.
uk: Ліміти фрагментів: до %1$lld фрагментів загалом, %2$lld на репозиторій.
vi: Giới hạn khối: tối đa %1$lld khối tổng, với %2$lld mỗi kho lưu trữ.
zh_hans: 分片数量限制：最多使用 %1$lld 条分片，每个仓库最多 %2$lld 条。
zh_hant: 分片數量限制：最多使用 %1$lld 條分片，每個倉庫最多 %2$lld 條。

# rag.workspace.debug.retrieval.settings.minimumSimilarityFormat
source: Minimum vector similarity: %.2f
ar: الحد الأدنى للتشابه المتجهي: %.2f
de: Minimale Vektorähnlichkeit: %.2f
es: Similitud vectorial mínima: %.2f
fr: Similarité vectorielle minimale : %.2f
id: Kemiripan vektor minimum: %.2f
it: Similarità vettoriale minima: %.2f
ja: 最小ベクトル類似度: %.2f
ko: 최소 벡터 유사도: %.2f
nl: Minimale vectorovereenkomst: %.2f
pl: Minimalne podobieństwo wektorowe: %.2f
pt_br: Similaridade vetorial mínima: %.2f
ru: Минимальное векторное сходство: %.2f
tr: Minimum vektör benzerliği: %.2f
uk: Мінімальна векторна подібність: %.2f
vi: Độ tương đồng vector tối thiểu: %.2f
zh_hans: 最低向量相似度：%.2f
zh_hant: 最低向量相似度：%.2f

# rag.workspace.debug.retrieval.settings.sourcesFormat
source: Sources: %@
ar: المصادر: %@
de: Quellen: %@
es: Fuentes: %@
id: Sumber: %@
it: Fonti: %@
ja: ソース: %@
ko: 출처: %@
nl: Bronnen: %@
pl: Źródła: %@
pt_br: Fontes: %@
ru: Источники: %@
tr: Kaynaklar: %@
uk: Джерела: %@
vi: Nguồn: %@
zh_hans: 检索来源：%@
zh_hant: 檢索來源：%@

# rag.workspace.debug.retrieval.settings.title
source: Current Retrieval Settings
ar: إعدادات الاسترجاع الحالية
de: Aktuelle Abrufeinstellungen
es: Configuración de recuperación actual
fr: Paramètres de récupération actuels
id: Pengaturan Pengambilan Saat Ini
it: Impostazioni di recupero correnti
ja: 現在の検索設定
ko: 현재 검색 설정
nl: Huidige ophaalinstellingen
pl: Bieżące ustawienia wyszukiwania
pt_br: Configurações Atuais de Recuperação
ru: Текущие настройки поиска
tr: Geçerli Alma Ayarları
uk: Поточні налаштування пошуку
vi: Cài đặt truy xuất hiện tại
zh_hans: 当前检索设置
zh_hant: 目前檢索設定

# rag.workspace.debug.retrieval.settings.tokenBudgetFormat
source: Chunk context budget: %lld tokens.
ar: ميزانية سياق الأجزاء: %lld رمزًا.
de: Chunk-Kontextbudget: %lld Token.
es: Presupuesto de contexto de fragmentos: %lld tokens.
fr: Budget de contexte des fragments : %lld tokens.
id: Anggaran konteks potongan: %lld token.
it: Budget contesto chunk: %lld token.
ja: チャンクコンテキスト予算: %lld トークン
ko: 청크 컨텍스트 예산: %lld 토큰.
pl: Budżet kontekstu fragmentów: %lld tokenów.
pt_br: Orçamento de contexto de fragmentos: %lld tokens.
ru: Бюджет контекста фрагментов: %lld токенов.
tr: Parça bağlam bütçesi: %lld token.
uk: Бюджет контексту фрагментів: %lld токенів.
vi: Ngân sách ngữ cảnh khối: %lld token.
zh_hans: 分片上下文预算：%lld Token。
zh_hant: 分片上下文預算：%lld Token。

# rag.workspace.debug.retrieval.sources.none
source: None
ar: لا شيء
de: Keine
es: Ninguna
fr: Aucune
id: Tidak Ada
it: Nessuna
ja: なし
ko: 없음
nl: Geen
pl: Brak
pt_br: Nenhuma
ru: Нет
tr: Hiçbiri
uk: Немає
vi: Không có
zh_hans: 未启用
zh_hant: 未啟用

# rag.workspace.debug.retrieval.unavailable
source: Retrieval diagnostics are unavailable for this request.
ar: تشخيصات الاسترجاع غير متاحة لهذا الطلب.
de: Abrufdiagnostik ist für diese Anfrage nicht verfügbar.
es: Los diagnósticos de recuperación no están disponibles para esta solicitud.
fr: Les diagnostics de récupération ne sont pas disponibles pour cette requête.
id: Diagnostik pengambilan tidak tersedia untuk permintaan ini.
it: Diagnostica di recupero non disponibile per questa richiesta.
ja: このリクエストでは検索診断を利用できません。
ko: 이 요청에 대한 검색 진단을 사용할 수 없습니다.
nl: Ophaaldiagnostiek is niet beschikbaar voor dit verzoek.
pl: Diagnostyka wyszukiwania jest niedostępna dla tego żądania.
pt_br: Diagnósticos de recuperação indisponíveis para esta solicitação.
ru: Диагностика поиска недоступна для этого запроса.
tr: Bu istek için alma tanılaması kullanılamıyor.
uk: Діагностика пошуку недоступна для цього запиту.
vi: Chẩn đoán truy xuất không khả dụng cho yêu cầu này.
zh_hans: 本轮请求没有可用的检索诊断信息。
zh_hant: 此請求沒有可用的檢索診斷資訊。

# rag.workspace.debug.stage.candidates
source: Candidates
ar: المرشحون
de: Kandidaten
es: Candidatos
fr: Candidats
id: Kandidat
it: Candidati
ja: 候補
ko: 후보
nl: Kandidaten
pl: Kandydaci
pt_br: Candidatos
ru: Кандидаты
tr: Adaylar
uk: Кандидати
vi: Ứng viên
zh_hans: 候选仓库
zh_hant: 候選倉庫

# rag.workspace.debug.stage.compressionPrompt
source: Conversation Compression Prompt
ar: موجه ضغط المحادثة
de: Gesprächskomprimierungs-Prompt
es: Prompt de compresión de conversación
fr: Invite de compression de conversation
id: Prompt Kompresi Percakapan
it: Prompt compressione conversazione
ja: 会話圧縮プロンプト
ko: 대화 압축 프롬프트
nl: Gesprekscompressieprompt
pl: Prompt kompresji rozmowy
pt_br: Prompt de Compressão da Conversa
ru: Промпт сжатия разговора
tr: Konuşma Sıkıştırma İstemi
uk: Підказка стиснення розмови
vi: Lời nhắc nén hội thoại
zh_hans: 会话压缩 Prompt
zh_hant: 對話壓縮 Prompt

# rag.workspace.debug.stage.compressionResponse
source: Conversation Compression Response
ar: استجابة ضغط المحادثة
de: Gesprächskomprimierungs-Antwort
es: Respuesta de compresión de conversación
fr: Réponse de compression de conversation
id: Respons Kompresi Percakapan
it: Risposta compressione conversazione
ja: 会話圧縮応答
ko: 대화 압축 응답
nl: Gesprekscompressierespons
pl: Odpowiedź kompresji rozmowy
pt_br: Resposta de Compressão da Conversa
ru: Ответ сжатия разговора
tr: Konuşma Sıkıştırma Yanıtı
uk: Відповідь стиснення розмови
vi: Phản hồi nén hội thoại
zh_hans: 会话压缩返回
zh_hant: 對話壓縮回應

# rag.workspace.debug.stage.failure
source: Failure
ar: فشل
de: Fehler
es: Fallo
fr: Échec
id: Kegagalan
it: Errore
ja: 失敗
ko: 실패
nl: Fout
pl: Błąd
pt_br: Falha
ru: Ошибка
tr: Başarısızlık
uk: Помилка
vi: Thất bại
zh_hans: 失败
zh_hant: 失敗

# rag.workspace.debug.stage.plan
source: Query Plan
ar: خطة الاستعلام
de: Abfrageplan
es: Plan de consulta
fr: Plan de requête
id: Rencana Kueri
it: Piano query
ja: クエリ計画
ko: 쿼리 계획
pl: Plan zapytania
pt_br: Plano de Consulta
ru: План запроса
tr: Sorgu Planı
uk: План запиту
vi: Kế hoạch truy vấn
zh_hans: 查询计划
zh_hant: 查詢計劃

# rag.workspace.debug.stage.plannerPrompt
source: Planner Prompt
ar: موجه المخطط
de: Planer-Prompt
es: Prompt del planificador
fr: Invite du planificateur
id: Prompt Perencana
it: Prompt planner
ja: プランナープロンプト
ko: 플래너 프롬프트
pl: Prompt planisty
pt_br: Prompt do Planejador
ru: Промпт планировщика
tr: Planlayıcı İstemi
uk: Підказка планувальника
vi: Lời nhắc lập kế hoạch
zh_hans: 查询规划 Prompt
zh_hant: 查詢規劃 Prompt

# rag.workspace.debug.stage.plannerResponse
source: Planner Response
ar: استجابة المخطط
de: Planer-Antwort
es: Respuesta del planificador
fr: Réponse du planificateur
id: Respons Perencana
it: Risposta planner
ja: プランナー応答
ko: 플래너 응답
nl: Plannerrespons
pl: Odpowiedź planisty
pt_br: Resposta do Planejador
ru: Ответ планировщика
tr: Planlayıcı Yanıtı
uk: Відповідь планувальника
vi: Phản hồi lập kế hoạch
zh_hans: 查询规划返回
zh_hant: 查詢規劃回應

# rag.workspace.debug.stage.prompt
source: LLM Prompt
ar: موجه LLM
es: Prompt del LLM
fr: Invite LLM
id: Prompt LLM
it: Prompt LLM
ja: LLM プロンプト
ko: LLM 프롬프트
pl: Prompt LLM
pt_br: Prompt do LLM
ru: Промпт LLM
tr: LLM İstemi
uk: Підказка LLM
vi: Lời nhắc LLM

# rag.workspace.debug.stage.remoteContext
source: Remote Context
ar: السياق البعيد
de: Remote-Kontext
es: Contexto remoto
fr: Contexte distant
id: Konteks Jarak Jauh
it: Contesto remoto
ja: リモートコンテキスト
ko: 원격 컨텍스트
nl: Externe context
pl: Kontekst zdalny
pt_br: Contexto Remoto
ru: Удалённый контекст
tr: Uzak Bağlam
uk: Віддалений контекст
vi: Ngữ cảnh từ xa
zh_hans: 远程上下文
zh_hant: 遠端上下文

# rag.workspace.debug.stage.remoteRequest
source: External Request
ar: طلب خارجي
de: Externe Anfrage
es: Solicitud externa
fr: Requête externe
id: Permintaan Eksternal
it: Richiesta esterna
ja: 外部リクエスト
ko: 외부 요청
nl: Extern verzoek
pl: Żądanie zewnętrzne
pt_br: Requisição Externa
ru: Внешний запрос
tr: Harici İstek
uk: Зовнішній запит
vi: Yêu cầu bên ngoài
zh_hans: 外部请求
zh_hant: 外部請求

# rag.workspace.debug.stage.remoteResponse
source: External Response
ar: استجابة خارجية
de: Externe Antwort
es: Respuesta externa
fr: Réponse externe
id: Respons Eksternal
it: Risposta esterna
ja: 外部応答
ko: 외부 응답
nl: Externe respons
pl: Odpowiedź zewnętrzna
pt_br: Resposta Externa
ru: Внешний ответ
tr: Harici Yanıt
uk: Зовнішня відповідь
vi: Phản hồi bên ngoài
zh_hans: 外部返回
zh_hant: 外部回應
